
---------------------------
-- 측정 SQL
---------------------------
SELECT 't1' AS "구간(TOP0501)" , round(a.cnt/a.dur) AS tps, cnt AS "처리건수" , etime AS "종료시간", stime AS "시작시간", dur AS "종료시간-시작시간"
FROM (
        SELECT count(*) AS cnt ,
                SUBSTR(max(REG_DATE),0,14)  AS etime,
                SUBSTR(min(REG_DATE),0,14)  AS stime,
                round(
                        (TO_DATE(SUBSTR(max(REG_DATE),0,14),'yyyymmddhh24miss') - TO_DATE(SUBSTR(min(REG_DATE),0,14),'yyyymmddhh24miss')
                        ) * 24 * 60 * 60) AS dur
        FROM TOP0501 WHERE REG_DATE >= '20221221080000000' AND REG_DATE  <= '20221221235900000'
) a
UNION all
SELECT 't3' AS "구간(TOP0503)" , round(a.cnt/a.dur) AS tps, cnt AS "처리건수" , etime AS "종료시간", stime AS "시작시간", dur AS "종료시간-시작시간"
FROM (
        SELECT count(*) AS cnt ,
                SUBSTR(max(REG_DATE),0,14)  AS etime,
                SUBSTR(min(REG_DATE),0,14)  AS stime,
                round(
                        (TO_DATE(SUBSTR(max(REG_DATE),0,14),'yyyymmddhh24miss') - TO_DATE(SUBSTR(min(REG_DATE),0,14),'yyyymmddhh24miss')
                        ) * 24 * 60 * 60) AS dur
        FROM TOP0503 WHERE REG_DATE >= '20221221080000000' AND REG_DATE  <= '20221221235900000'
    ) a;


SELECT
	round((a.cnt + b.cnt ) / b.dur) AS tps,
	a.cnt 	AS t1_cnt,
	a.stime AS t1_start_time,
	a.etime AS t1_end_time,
	a.dur 	AS t1_dur,
	b.cnt 	AS t3_cnt,
	b.stime AS t3_start_time,
	b.etime AS t3_end_time,
	b.dur 	AS t3_dur
FROM (
	SELECT count(*) AS cnt ,
		SUBSTR(max(REG_DATE),0,14)  AS etime,
		SUBSTR(min(REG_DATE),0,14)  AS stime,
		round(
			(TO_DATE(SUBSTR(max(REG_DATE),0,14),'yyyymmddhh24miss') - TO_DATE(SUBSTR(min(REG_DATE),0,14),'yyyymmddhh24miss')
			) * 24 * 60 * 60) AS dur
	FROM TOP0501 WHERE REG_DATE >= '20221221100000000' AND REG_DATE  <= '20221221235900000'
) a, (
	SELECT count(*) AS cnt ,
		SUBSTR(max(REG_DATE),0,14)  AS etime,
		SUBSTR(min(REG_DATE),0,14)  AS stime,
		round(
			(TO_DATE(SUBSTR(max(REG_DATE),0,14),'yyyymmddhh24miss') - TO_DATE(SUBSTR(min(REG_DATE),0,14),'yyyymmddhh24miss')
			) * 24 * 60 * 60) AS dur
	FROM TOP0503 WHERE REG_DATE >= '20221221100000000' AND REG_DATE  <= '20221221235900000'
) b;


-- [성능측정 DATA]
-- 프로세스 3개 스레드 4개 
------------------------------------------------------------------------------------------------------------------------------------------------------------------
-- APP   TYPE        TPS	TOP0501_CNT	    TOP0501_START_TIME  TOP0501_END_TIME	TOP0501_DUR	TOP0503_CNT	TOP0503_START_TIME	TOP0503_END_TIME	TOP0503_DUR	
------------------------------------------------------------------------------------------------------------------------------------------------------------------
--  B    완료건처리    5000    450000          20221220153942      20221220154122      100         60000       20221220153942      20221220154124      102         
--  B    진행중포함    5598    449416          20221221085854      20221221090023       89         60000       20221221085854      20221221090025       91         
--  C    완료건처리    1678    450000          20221221091205      20221221091725      320         60000       20221221091206      20221221091710      304         
--  C    진행중포함     898    449437          20221221092221      20221221093149      568         60000       20221221092222      20221221093149      567         
--  A    완료건처리    1063    450000          20221221100554      20221221100938      224         60000       20221221100556      20221221101356      480         
--  A    진행중포함     818	   449354	       20221221102030	   20221221102646	   376	       60000	   20221221102032	   20221221103055	   623         

-- 프로세스 1개 스레드 4개 
------------------------------------------------------------------------------------------------------------------------------------------------------------------
-- APP  TYPE         TPS	TOP0501_CNT	    TOP0501_START_TIME  TOP0501_END_TIME	TOP0501_DUR	TOP0503_CNT	TOP0503_START_TIME	TOP0503_END_TIME	TOP0503_DUR	
------------------------------------------------------------------------------------------------------------------------------------------------------------------
--  B  완료건처리      4048	    150000	        20221221105718	    20221221105758	    40	        20000	    20221221105718	    20221221105800	     42
--  B  진행중포함      3859	    149792	        20221221110056	    20221221110138      42	        20000	    20221221110056	    20221221110140	     44
--  C  완료건처리      1056	    150000	        20221221110558	    20221221110844	   166	        20000	    20221221110559	    20221221110840	    161
--  C  진행중포함      1082	    149807	        20221221111949	    20221221112227	   158	        20000	    20221221111950	    20221221112227	    157
--  A  완료건처리       971	    150000	        20221221103657	    20221221103807	    70	        20000	    20221221103659	    20221221103954	    175
--  A  진행중포함       982	    149802	        20221221104946	    20221221105114	    88	        20000	    20221221104948	    20221221105241	    173


--- 프로세스 1개 스레드 6개 
------------------------------------------------------------------------------------------------------------------------------------------------------------------
-- APP  TYPE         TPS	TOP0501_CNT	    TOP0501_START_TIME  TOP0501_END_TIME	TOP0501_DUR	TOP0503_CNT	TOP0503_START_TIME	TOP0503_END_TIME	TOP0503_DUR	
------------------------------------------------------------------------------------------------------------------------------------------------------------------
--  B  완료건처리      4146	    150000	        20221221130500	    20221221130539	    39	        20000	    20221221130500	    20221221130541	    41


--- 프로세스 1개 스레드 4개 (cache vendor : java ) 
------------------------------------------------------------------------------------------------------------------------------------------------------------------
-- APP  TYPE         TPS	TOP0501_CNT	    TOP0501_START_TIME  TOP0501_END_TIME	TOP0501_DUR	TOP0503_CNT	TOP0503_START_TIME	TOP0503_END_TIME	TOP0503_DUR	
------------------------------------------------------------------------------------------------------------------------------------------------------------------
--  B  완료건처리      4250		150000			20221221151414		20221221151452		38			20000		20221221151414		20221221151454		40
